In [1]:
import numpy as np
import pandas as pd

In [ ]:
np.random.seed(seed=2)
np.random.choice([1, 2, 3], size=7)

array([1, 2, 1, 3, 3, 1, 3])

In [3]:
np.random.seed(seed=1)
df = pd.DataFrame(data={'A': np.random.choice([1, 2, 3, np.nan], size=3),
                        'B': np.random.choice([1, np.nan], size=3),
                        'C': np.random.choice([10, 20], size=3), }
                  )
df          # Displaying the DataFrame created with random choices

     A    B   C
0  2.0  1.0  20
1  NaN  NaN  20
2  1.0  NaN  20

In [4]:
df.isnull()  # Checking for null values in the DataFrame

       A      B      C
0  False  False  False
1   True   True  False
2  False   True  False

In [5]:
df.isnull().sum()  # Summing up the null values in each column

A    1
B    2
C    0
dtype: int64

In [6]:
df

     A    B   C
0  2.0  1.0  20
1  NaN  NaN  20
2  1.0  NaN  20

In [7]:
df.dropna()  # Dropping rows with any null values

     A    B   C
0  2.0  1.0  20

In [8]:
df.dropna(axis=1)  # Dropping columns with any null values

    C
0  20
1  20
2  20

In [ ]:
df.dropna(thresh=2)

     A    B   C
0  2.0  1.0  20
2  1.0  NaN  20

In [10]:
df.dropna(subset=['A'])

     A    B   C
0  2.0  1.0  20
2  1.0  NaN  20

In [11]:
df

     A    B   C
0  2.0  1.0  20
1  NaN  NaN  20
2  1.0  NaN  20

In [12]:
df.fillna(value=0)  # Filling null values with 0

     A    B   C
0  2.0  1.0  20
1  0.0  0.0  20
2  1.0  0.0  20

In [13]:
df.fillna(value=0).info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       3 non-null      float64
 1   B       3 non-null      float64
 2   C       3 non-null      int64
dtypes: float64(2), int64(1)
memory usage: 204.0 bytes

In [15]:
df['A'].fillna(value=df['A'].mean(), inplace=True)
df # Filling null values in column 'A' with its mean

     A    B   C
0  2.0  1.0  20
1  1.5  NaN  20
2  1.0  NaN  20